# MERGING

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})

In [3]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [4]:
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})

In [5]:
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [7]:
df1.merge(df2, left_on="lkey", right_on="rkey")

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [8]:
merge_table=pd.merge(df1,df2,left_on="lkey", right_on="rkey")

In [9]:
merge_table

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [10]:
df1.merge(df2, left_on='lkey', right_on='rkey',
          suffixes=('_left', '_right'))

  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  foo           5  foo            5
3  foo           5  foo            8
4  bar           2  bar            6
5  baz           3  baz            7

In [12]:
df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=('.1', '.2'))

  lkey  value.1 rkey  value.2
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [13]:
df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})

In [14]:
df1

     a  b
0  foo  1
1  bar  2

In [15]:
df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})
df2

     a  c
0  foo  3
1  baz  4

In [16]:
merge_1=pd.merge(df1,df2,on="a",how="inner")

In [17]:
merge_1

     a  b  c
0  foo  1  3

In [18]:
merge_1=pd.merge(df1,df2,on="a",how="outer")

In [19]:
merge_1

     a    b    c
0  foo  1.0  3.0
1  bar  2.0  NaN
2  baz  NaN  4.0

In [21]:
merge_1=pd.merge(df1,df2,on="a",how="left")
merge_1

     a  b    c
0  foo  1  3.0
1  bar  2  NaN

In [22]:
merge_1=pd.merge(df1,df2,on="a",how="right")
merge_1

     a    b  c
0  foo  1.0  3
1  baz  NaN  4

In [23]:
df1 = pd.DataFrame({'left': ['foo', 'bar']})
df2 = pd.DataFrame({'right': [7, 8]})

In [24]:
df1

  left
0  foo
1  bar

In [25]:
df2

   right
0      7
1      8

In [26]:
df1.merge(df2, how='cross')

  left  right
0  foo      7
1  foo      8
2  bar      7
3  bar      8